{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "text": "What is a rodent?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Rodents are gnawing mammals and are distinguished by their strong constantly growing incisor teeth. Rodents use their powerful incisor teeth as chisel tools to gnaw through insulation wood walls and electrical wiring causing extensive damage to homes and structures. Common pest rodents include the house mice deer mice Norway rats and roof rats. Rodents are nocturnal meaning they are active at night and not during the day."
      }
    },
    {
      "@type": "Question",
      "text": "What do rodents look like and what do they eat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "All rodents share a few common characteristics including: furry robust bodies short legs long tails and a pair of incisor teeth that never stop growing. Rodents use their strong teeth to gnaw through wood aluminum siding sheet rock soft cement and to defend themselves. Most rodents tend to prefer eating plant foods like seeds grains and small fruit. However mice and rats are omnivores meaning their diet consists of plant and animal products."
      }
    },
    {
      "@type": "Question",
      "text": "What are the most common rodents in homes?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "House mice Norway rats and roof rats are the three most common rodent species to invade homes. These rodent pests are commensal which means “to share the table.” Rodent pests  are commensal because they are generally found living in close association with humans and dependent upon the human habitat for food and shelter. Mice and rats inhabit homes gardens farms food stores apartments and commercial buildings."
      }
    },
    {
      "@type": "Question",
      "text": "What are the differences between a mouse and a rat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "While mice and rats share a few common characteristics the major differences between them is their size and diet. The typical house mouse is 2-4” in length as opposed to the Norway rat or roof rat which can measure up to 9” in length. Both mice and rats are omnivores but rats will eat anything and generally prefer meat pet food fish and stored cheeses. Mice prefer grains fruits vegetables seeds and nuts."
      }
    },
    {
      "@type": "Question",
      "text": "What does a house mouse look like?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Adult house mice range in total size from 5-8” in length including their tail. Their ears are very large and distinct in comparison to their small furry bodies. The house mouse is light brown to nearly black in color with a slightly lighter belly. The tail of a house mouse is hairless and as long as the body and head combined. An adult house mouse weighs up to one ounce although some mice may be heavier."
      }
    },
    {
      "@type": "Question",
      "text": "What does a Norway rat look like?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Norway rats are large robust rodents and the average adult measures 16” in total length from its snout to the end of its tail. Norway rats are generally grayish-brown to black or reddish-brown in color and the length of its tail is shorter than its body.  The Norway rat's tail is darker on top and more pale underneath. Norway rats can weigh between 7-18 ounces."
      }
    },
    {
      "@type": "Question",
      "text": "What does a roof rat look like?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Adult roof rats sometimes called black rats are medium-sized rats weighing 8-12 ounces and measuring about 16” from nose to tip of tail. Although the roof rats length is similar to the Norway rat the roof rat's tail is longer than the body and a key identifying characteristic. Roof rats tend to be more slender and sleeker than Norway rats and adults  may be brown to entirely black in color."
      }
    },
    {
      "@type": "Question",
      "text": "Where do mice and rats live?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "When choosing nesting sites near homes house mice will construct nests outdoors in ground burrows barns and sheds and will construct nests indoors in attics wall voids storage boxes and under appliances. Norway rats construct burrows outside along foundations and gardens or may be found inside homes in basements and crawl spaces. Excellent climbers roof rats prefer to nest in trees rooflines block walls attics garages sheds and in ceilings."
      }
    },
    {
      "@type": "Question",
      "text": "How do mice and rats get inside homes?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Rodents are exceptional climbers using their athletic abilities to gain access to homes. Rats  can leap more than 4 feet horizontally and will jump from overhanging trees to access roof lines and attics. Mice can squeeze through a hole the size of a dime and rats only need a gap the size of a quarter. Rodents enter homes using gaps around dryer vents utility pipes exterior doors and chimneys."
      }
    },
    {
      "@type": "Question",
      "text": "Can mice and rats spread disease?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Rodents are known to spread more than 35 diseases including hantavirus leptospirosis lymphocytic choriomeningitis (LCMV) Tularemia and Salmonella. These diseases can be spread to humans directly by handling live or dead rodents through contact with rodent feces urine or saliva and through rodent bites. Additionally the droppings and urine of house mice and rats contain allergens that can trigger rhinitis in susceptible individuals."
      }
    },
    {
      "@type": "Question",
      "text": "What damage can mice and rats cause in homes?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Mice and rats gnaw through wood aluminum plastic pipes and sheetrock and can damage electrical wiring. Due to their gnawing damage rodent infestations hold the potential for serious damage related to fires and explosions. Accounts of rodents starting fires by carrying matches to their hiding places as well as causing short circuits through the gnawing of electrical wires have been widely reported. Chewed exposed wires inside walls can spark causing interior walls to catch fire."
      }
    },
    {
      "@type": "Question",
      "text": "What are signs of a rodent infestation?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Common signs of a rodent infestation include the actual sighting of live or dead rodents droppings gnaw marks rub marks gnawed fruit in trees and scratching sounds at night. Look for gnaw marks on door corners walls and baseboards. Rat droppings are shiny black and ½” to ¾” long and mice droppings are smaller with pointed ends. Burrows outdoors along foundation and walls or beneath debris or shrubbery are obvious signs of a Norway rat infestation."
      }
    },
    {
      "@type": "Question",
      "text": "What attracts mice and rats to homes?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Rodents enter homes for three reasons:shelter warmth and food. Rats and mice are warm blooded and if they have access will nest in attics wall voids garages and crawl spaces. Rodents are attracted to food sources like grains nuts meat birdseed pet food garbage and anything salty or sweet. Dripping pipes and leaky faucets provide rodents with a water resource. Additionally rats are attracted to compost piles and pet waste debris in yards."
      }
    },
    {
      "@type": "Question",
      "text": "How do you get rid of rodents in the home?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Inspection sanitation and exclusion are three steps homeowners can take to help eliminate a rodent infestation. Inspect your property for signs of rodents. Eliminate entry points by rodent-proofing your home. Snap traps live traps and glue boards can be an easy and inexpensive way to get rid of rodents. However if the rodent infestation is large a pest management professional may be required to eliminate the infestation for good."
      }
    },
    {
      "@type": "Question",
      "text": "How can you prevent a rodent infestation?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "To deter rodents eliminate access to your home and remove the food and water resources that attract them. Seal gaps and holes around utility cables outdoor vents or pipe work with steel wool or silicone-based caulk. Keep your home clean and free of clutter and use tight fitting lids on trash bins.  Outdoors pick up fallen fruit clean up around bird feeders or use a “no-waste bird food” remove leaf litter and and pick up pet waste."
      }
    }
  ]
}
